ideas_stuff/idea.tex
                                % Created 2020-09-17 Thu 12:15
                                % Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
  pdfauthor={},
  pdftitle={},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 26.3 (Org mode 9.1.9)},
  pdflang={English}}
\begin{document}

\tableofcontents

\section{VOLLEY STATS}
\label{sec:org2138eb4}
\subsection{LOGIN}
\label{sec:org1d4b556}
\subsubsection{code from}
\label{sec:org6d1330d}
loginpage from
\url{https://www.listendata.com/2019/06/how-to-add-login-page-in-shiny-r.html}
maybe it's better to use Docker-based shinyproxy package which
maybe are better in terms of security cause right now the password
are same as plain text in the code \ldots{}

\subsubsection{Permission}
\label{sec:org4aa8b35}
login for now there are 2 permission level
\begin{itemize}
\item basic
  it should be allowed only to see stats
\item advanced
  it should be able to see and upload stats but not to modify it
\item admin
  not here yet, but it should be able to see, collect and modify data and stats
  also could be usefull to see the trafic and other stats of the website
\end{itemize}
\subsection{modules}
\label{sec:orga853edf}
in general the website will be based on modules which can be add
and deleted (something like nestor which i really like!) (save the
configuration of it based on the user so that
next time the same user login the configuration should be restored)
\begin{itemize}
\item Attack (wp)
\item Serve (wp)
\item Pass (wp)
\item Ball distribution (TODO)
\item Block (TODO)
\end{itemize}

\subsection{stats}
\label{sec:orgf104969}
\subsubsection{Player}
\label{sec:org1975346}
\begin{itemize}
\item select player
\item select game
\item modules
  \begin{itemize}
  \item Attack
  \item Serve
  \item Pass
  \item Ball distribution
  \item Block
  \end{itemize}
\end{itemize}

\subsubsection{Team}
\label{sec:org2c5bee9}
\begin{itemize}
\item select position
\item select game
\item modules
  same as in Player (?)
\end{itemize}

\subsection{trends}
\label{sec:org6ed3af6}
i need temporal information to do that !!
in general this section should highlight the progression of the
team/player across time on each of the statistics that we are
keeping track of
\subsubsection{Player}
\label{sec:orga8a60b4}
\begin{itemize}
\item same selection possibility as in Player stats
\item module  TODO
\end{itemize}

\subsubsection{Team}
\label{sec:org450caec}
\begin{itemize}
\item same selection possibility as in Team stats
\item module TODO
\end{itemize}

\subsection{Data}
\label{sec:org4cb68f5}
we have to add :
\begin{itemize}
\item Setter
  would be great to know who was the setter in a specific set
\item date for each game
\item Team
\item Position
  this can be done as a separate file with maps player to
  position
\item Block
  maybe we can also add block error? which  I think is the only
  thing that is missing in order to have some kind of share
  structure between attack serve and block
\end{itemize}
\end{document}
